---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DefinesConstantHeight
source: html/ba175bff-93c1-dd07-b263-76d48f8a035d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DefinesConstantHeight Property

"Defines Constant Height"

## Syntax (C#)
```csharp
public static ForgeTypeId DefinesConstantHeight { get; }
```